{
    "char_to_index": {
        "<PAD>": 0,
        "<SOS>": 1,
        "<EOS>": 2,
        " ": 3,
        "!": 4,
        "\"": 5,
        "#": 6,
        "$": 7,
        "%": 8,
        "&": 9,
        "'": 10,
        "(": 11,
        ")": 12,
        "*": 13,
        "+": 14,
        ",": 15,
        "-": 16,
        ".": 17,
        "/": 18,
        "0": 19,
        "1": 20,
        "2": 21,
        "3": 22,
        "4": 23,
        "5": 24,
        "6": 25,
        "7": 26,
        "8": 27,
        "9": 28,
        ":": 29,
        ";": 30,
        "<": 31,
        "=": 32,
        ">": 33,
        "?": 34,
        "@": 35,
        "[": 36,
        "\\": 37,
        "]": 38,
        "^": 39,
        "_": 40,
        "`": 41,
        "a": 42,
        "b": 43,
        "c": 44,
        "d": 45,
        "e": 46,
        "f": 47,
        "g": 48,
        "h": 49,
        "i": 50,
        "j": 51,
        "k": 52,
        "l": 53,
        "m": 54,
        "n": 55,
        "o": 56,
        "p": 57,
        "q": 58,
        "r": 59,
        "s": 60,
        "t": 61,
        "u": 62,
        "v": 63,
        "w": 64,
        "x": 65,
        "y": 66,
        "z": 67,
        "{": 68,
        "|": 69,
        "}": 70,
        "~": 71
    },
    "index_to_char": {
        "0": "<PAD>",
        "1": "<SOS>",
        "2": "<EOS>",
        "3": " ",
        "4": "!",
        "5": "\"",
        "6": "#",
        "7": "$",
        "8": "%",
        "9": "&",
        "10": "'",
        "11": "(",
        "12": ")",
        "13": "*",
        "14": "+",
        "15": ",",
        "16": "-",
        "17": ".",
        "18": "/",
        "19": "0",
        "20": "1",
        "21": "2",
        "22": "3",
        "23": "4",
        "24": "5",
        "25": "6",
        "26": "7",
        "27": "8",
        "28": "9",
        "29": ":",
        "30": ";",
        "31": "<",
        "32": "=",
        "33": ">",
        "34": "?",
        "35": "@",
        "36": "[",
        "37": "\\",
        "38": "]",
        "39": "^",
        "40": "_",
        "41": "`",
        "42": "a",
        "43": "b",
        "44": "c",
        "45": "d",
        "46": "e",
        "47": "f",
        "48": "g",
        "49": "h",
        "50": "i",
        "51": "j",
        "52": "k",
        "53": "l",
        "54": "m",
        "55": "n",
        "56": "o",
        "57": "p",
        "58": "q",
        "59": "r",
        "60": "s",
        "61": "t",
        "62": "u",
        "63": "v",
        "64": "w",
        "65": "x",
        "66": "y",
        "67": "z",
        "68": "{",
        "69": "|",
        "70": "}",
        "71": "~"
    },
    "chars": [
        " ",
        "!",
        "\"",
        "#",
        "$",
        "%",
        "&",
        "'",
        "(",
        ")",
        "*",
        "+",
        ",",
        "-",
        ".",
        "/",
        "0",
        "1",
        "2",
        "3",
        "4",
        "5",
        "6",
        "7",
        "8",
        "9",
        ":",
        ";",
        "<",
        "=",
        ">",
        "?",
        "@",
        "[",
        "\\",
        "]",
        "^",
        "_",
        "`",
        "a",
        "b",
        "c",
        "d",
        "e",
        "f",
        "g",
        "h",
        "i",
        "j",
        "k",
        "l",
        "m",
        "n",
        "o",
        "p",
        "q",
        "r",
        "s",
        "t",
        "u",
        "v",
        "w",
        "x",
        "y",
        "z",
        "{",
        "|",
        "}",
        "~"
    ]
}